fraserb99/ee579-msp430/Group Project/main.c
#include <msp430.h> 


/**
 * main.c for Group 4
 *
 *
 * based on previous challenges and examples from TI code
 */

//Global variables and constants
//inputs
//button stuff
signed int button = -1;                         //Button variable, depends on timer used
unsigned int b_activated = 0;                   //boolean for denoting button activation
unsigned int timerCount = 0;                    //initial count for the wait time
unsigned int pressed = 0;                       //checking for pressed state, used for debouncing
unsigned int held = 0;                          //checking if the button is being pressed/held
const int debounce_b = 328;                     //count for the 50Hz, based on 32768/(2*x)= 50, want a 20ms wait for the debouncing, 1/20*10^-3 = 50
const int count_b = 820;                        //count for the count for presses, rate of 20Hz, based on 32768/(2x) = 20Hz
int activated_button[];                         //indicator for activated timer for the button

//Button 2 (called switch
signed int button2 = -1;                        //Button 2 variable
unsigned int b2_activated = 0;                  //button 2 activation
unsigned int timerCount2 = 0;                   //initial count for the wait time
unsigned int pressed2 = 0;                      //checking for pressed state, used for debouncing
unsigned int held2 = 0;                         //checking if the button is being pressed/held
const int debounce_b2 = 164;                    //count for the 100Hz, based on 32768/(2*x)= 100, want a 10ms wait for the debouncing, 1/20*10^-3 = 50
const int count_b2 = 820;                       //count for the count for presses, rate of 20Hz, based on 32768/(2x) = 20Hz
int activated_button2[];                        //indicator for activated timer for the button

//potentiometer stuff
unsigned int pot = 0;                           //Potentiometer use
unsigned int pot_activated = 0;                 //boolean for denoting potentiometer activation
unsigned int orig_val = 0;                      //Setting up value for original potentiometer vale
unsigned int value = 0;                         //value on check
signed int change = 0;                          //value to check how much the pot has changed
const int step_size = 100;                       //value to indicate step size

//temp stuff
signed int thermometer = -1;                    //thermometer use
unsigned int t_activated = 0;                   //boolean for denoting thermometer activation
signed int orig_temp = 0;                       //Setting up value for original potentiometer vale
signed int value_temp = 0;                      //value on check
unsigned int temp = 0;
signed long change_t = 0;                       //value to check how much the pot has changed
const int step_size_t = 2;                      //value to indicate step size, as error is +- 2 step size is set to 2 for more stable operation
unsigned int stable = 0;                        //boolean for determining if stable Vref
unsigned int sample_temp = 0;                   //boolean to be used to indicate a sample should be taken
const int sample_temp_time = 16384;             //used for sample time of the temperature 16384
int activated_temp[];                           //indicator for activated timer for the temperature

//Outputs
//constants for breathing and fading lights, same for all LEDs independent of user defined speeds
const int max_brightness = 32;                  //used for checking max value for brightness and counter value
const int change_period = 16;                   //period for flashing and breathing, default values
const int brightness_register_1 = 4096;         //used for brightness increment timing, 1Hz, first setting
const int brightness_register_2 = 2048;         //used for brightness increment timing, 2Hz, second setting
const int brightness_register_3 = 1024;         //used for brightness increment timing, 4Hz, third setting
//LED1 stuff
signed int led1_on = 0;                         //LED D1 on, 0 indicate off, -1 - deactivate
unsigned int led1_active = 0;                   //check if the light has been activated - can only have one setting on at a time
unsigned int led1_fo_active = 0;                //own activation check for fade out as that can turn lights of that are on, if wanted
signed int led1_blink = -1;                     //LED1 blinking light
signed int led1_fade_in = -1;                   //LED1 fade in
signed int led1_fade_out = -1;                  //LED1 fade out
signed int led1_breath = -1;                    //LED1 blinking light
unsigned int blink_rate_1 = 16384;              //rate for the blinking light of LED D1, default period 1Hz
unsigned int light_flag_1 = 0;                  //breathing and fading light flag, brighter or darker,  brighter = 0, darker = 1;
unsigned int brightness_1 = 0;                  // Varies brightness between 0 and 32
unsigned int counter_val_1 = 0;                 //counter for the LED on time
unsigned int period_1 = 2048;                   //overall period for the fading and breathing light, default is 2Hz
int activated_led1[];                           //Array for activated timers for LED D1

//LED2 stuff
signed int led2_on = 0;                         //LED D2 on
unsigned int led2_active = 0;                   //LED2 active
unsigned int led2_fo_active = 0;                //own activation check for fade out as that can turn lights of that are on, if wanted
signed int led2_blink = -1;                     //LED2 blink
signed int led2_fade_in = -1;                   //LED2 fade in
signed int led2_fade_out = -1;                  //LED2 fade out
signed int led2_breath = -1;                    //LED2 breathing light
unsigned int blink_rate_2 = 16384;              //rate for the blinking light of LED D2, default period 1Hz
unsigned int light_flag_2 = 0;                  //breathing and fading light flag, brighter or darker,  brighter = 0, darker = 1;
unsigned int brightness_2 = 0;                  //varies brightness between 0 and 32
unsigned int counter_val_2 = 0;                 //LED counter
unsigned int period_2 = 2048;                   //period for flashing and breathing, default
int activated_led2[];                          //Array for activated timers for LED D2

