fraserb99/ee579-msp430/Group Project/main.c
//LED3 stuff
signed int led3_on = 0;                         //LED D3 on/off, colour light
unsigned int led3_active = 0;                   //LED3 active
unsigned int led3_fo_active = 0;                //own activation check for fade out as that can turn lights of that are on, if wanted
signed int led3_rot = -1;                       //rotate led3
signed int led3_dir = 0;                        //LED3 direction of rotation, -1 for backwards and 1 for forwards
signed int led3_blink = -1;                     //LE3 blink
unsigned int led3_blink_on = 0;                 //used to indicate on or off light
signed int led3_fade_in = -1;                   //LED3 fade in
signed int led3_fade_out = -1;                  //LED3 fade out
signed int led3_breath = -1;                    //LED3 blinking light
//define all the colours
#define RED (BIT1)
#define GREEN (BIT3)
#define BLUE (BIT5)
#define YELLOW (BIT1 + BIT3)
#define PURPLE (BIT1 + BIT5)
#define CYAN (BIT3 + BIT5)
#define WHITE (BIT1 + BIT3 + BIT5)
const int colours[] = {RED, GREEN, BLUE, YELLOW, PURPLE, CYAN, WHITE};    //Array for the colours
unsigned int colour = 0;                        //The colour selected
unsigned int blink_rate_3 = 16384;              //rate for the blinking light for LED D3, or rotating, default 1Hz
signed int light_flag_3 = 0;                    //breathing and fading light flag, brighter or darker,  brighter = 1, darker = -1;
signed int brightness_3 = 0;                    //used for determining brightness, initially between 0 and 4
unsigned int flash_count_3 = 0;                 //LED counter
unsigned int counter_val_3 = 1;                  //duty cycle for breathing and flashing, default of 2048Hz
unsigned int period_3 = 2048;                    //period for flashing and breathing, default of 16Hz
int activated_led3[];                           //Array for activated timers for the colour led

//buzzer stuff
signed int buzzer_tone = 0;                  //buzzer on, for specific period
signed int buzzer_beep = 0;                     //buzzer beeping
unsigned int buzzer_active = 0;                 //boolean for indicating that the buzzer has been activated/is being used
unsigned int buzzer_on = 0;                     //boolean used for indicating if the buzzer is on during the beep one
unsigned int buzzer_duration = 2000;            //buzzer duration, in ms, will be divided to closest 100ms, 2000 is default
unsigned int buzzer_duration_off = 1000;        //second buzzer duration for the beeping, off period, to nearest 100ms, 1000 is default
unsigned int buzzer_count = 0;                  //counter variable for the on period of the buzzer
const int buzzer_period = 82;                 //timer for counting the required on period, 50ms = 20Hz
int activated_buzzer[];                         //Array for activated timer for the buzzer

//array for timer usage, 0 if not used, 1 if used 0, pos 0:TA0_0, 1:TA0_1, 2:TA0_2, 3:TA1_0, 4: TA1_1, 5:TA1_2
unsigned int timers_used[6] = {0, 0, 0, 0, 0, 0};
unsigned int timer0_activated = 0;              //Boolean used for checking if TA0 has been activated
unsigned int timer1_activated = 0;              //Boolean used for checking if TA1 has been activated
signed int activated_timers[2] = {-1, -1};      //array for activated timers for each activation

//array for used lights If 1 means active, if 0 not active, Returns array of status for each light, pos0 = D1, pos1 = D2, pos3 = D3
unsigned int lights_used[3] = {0, 0, 0};
//arrays for breathing and fading lights

//declare helper functions
int activate_timer(int timer_no, int count1, int count2);       //function for activating a specific timer
int activate_free_timer(int registers, int counts[]);           //function for activating required number of free timers
void deactivate_timer(int activated[], int len);                //deactivate unused timers
int get_timer_code(int timers[]);                               //get the specific timer code for 2 timers


/* Description of codes used for the timers:
 * for those with 1 timer:
 * A0_0 = 0, A0_1 = 1, A0_2 = 2, A1_0 = 3, A1_1 = 4, A1_2 = 5
 *
 * For 2 timers
 * A0_0 +           A0_1 +          A0_2 +          A1_0 +          A1_1 +
 *      A0_1 = 10,      A0_2 = 15,      A1_0 = 19,      A1_1 = 22,      A1_2 = 24,
 *      A0_2 = 11,      A1_0 = 16,      A1_1 = 20,      A1_2 = 23,
 *      A1_0 = 12,      A1_1 = 17,      A1_2 = 21,
 *      A1_1 = 13,      A1_2 = 18,
 *      A1_2 = 14,
 *
 * -2 indicate disable/turn off, -1 is the equivalent of off
 *
 */

//main function
int main(void)
 {
	WDTCTL = WDTPW | WDTHOLD;	// stop watchdog timer

	//stuff for testing
	//P1DIR |= BIT0 + BIT6;      // P1.0, P1.6 output
	//P2DIR |= BIT1;             //utilise D3
	button = 1;
	//button2 = 1;
	//pot = 1;
	//thermometer = 1;
	//led1_blink = 1;
	//blink_rate_3 = 32768;
	//led3_on = 1;
	//led1_blink = 1;
	//led3_rot = 1;
	//led3_dir = 1;
	//led1_breath = 1;
    //led1_fade_in = 1;
	//led3_fade_out = 1;
	buzzer_beep = 1;



	__bis_SR_register(GIE);                     //interrupt enabled

    while(1){
        //read messages here


        //input
        //check if button was requested
        if (button > -1){
            if (!b_activated){ //if not already activated
                //button set up, from slides and previous challenge
                P1OUT |= BIT3;                            //pull up resistor on P1.3
                P1REN |= BIT3;                            //Enable it
                P1IES |= BIT3;                            //high to low edge
                P1IFG &= ~BIT3;                           // Clear flag
                P1IE |= BIT3;                             //Interrupt enable

                int counts[1] = {debounce_b};
                b_activated = activate_free_timer(1, counts);
                //record which ones were activated
                activated_button[0] = activated_timers[0];
                button = activated_button[0];                //assign to check properly for timer interrupts
                if (b_activated != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                }
            }
        } else if(button == -2){
            b_activated = 0;                        //if button is no longer requested
            deactivate_timer(activated_button, 2);   //turn off timer
            P1IE &= ~BIT3;                          //and button interrupt
            P1REN |= BIT3;                          // and dissable the pullup/pulldown
            button = -1;
        }


        //check button 2, same code as button 1 pretty much, just different pins
        //Copied from button 1
        if (button2 > -1){
            if (!b2_activated){ //if not already activated
                P1OUT |= BIT5;                            //pull up resistor on P1.5
                P1REN |= BIT5;                            //Enable it
                P1IES |= BIT5;                            //high to low edge
                P1IFG &= ~BIT5;                           // Clear flag
                P1IE |= BIT5;                             //Interrupt enable

