fraserb99/ee579-msp430/Group Project/main.c
                int counts[1] = {debounce_b2};
                b2_activated = activate_free_timer(1, counts);
                //record which ones were activated
                activated_button2[0] = activated_timers[0];
                button2 = activated_button2[0];                //assign to check properly for timer interrupts
                if (b2_activated != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                }
            }
        } else if(button2 == -2){
            b2_activated = 0;                        //if button is no longer requested
            deactivate_timer(activated_button2, 2);   //turn off timer
            P1IE &= ~BIT5;                          //and button interrupt
            P1REN |= BIT5;                          // and dissable the pullup/pulldown
            button2 = -1;
        }

        //need checks to see if potentiometer was requested
        if (pot){
            if(!pot_activated){ //if not already activated
                ADC10CTL0 = ADC10ON + CONSEQ_0;            // ADC10ON, single channel single sample
                ADC10CTL1 = INCH_4 + ADC10SSEL_1;          // input A4, clock = ACLK
                ADC10AE0 |= BIT4;                          // PA.4 ADC option select

                //get original value
                ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
                orig_val = ADC10MEM;
                pot_activated = 1;
            }

            ADC10CTL0 |= SREF_0;                    //set ref to 0
            ADC10CTL1 |= INCH_4;                     //Ensure right channel
            ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
            ADC10AE0 |= BIT4;                          // PA.4 ADC option select
            //ADC10MEM = conversion result
            //wait for result completion, triggers interrupt when done, ADC10Iflag
            /*while ((ADC10CTL1 & ADC10BUSY) == 1) {//check if busy
                //Wait for sample to take place
            }*/
            value = ADC10MEM;           //Just to make sure the value doesn't change during checking
            //reset ENC
            ADC10CTL0 &= ~ENC;

            if(value != orig_val){ //if value has changed
                //check by how much
                change = abs(orig_val - value);

                if (change >= step_size){
                    //send message

                    //change to new orig value
                    orig_val = value;
                    //testing light
                    P1OUT ^= BIT6;
                }

            }
            //Code here for the potentiometer, so basically send stuff at interval checks
        } else {
            pot_activated = 0;
        }

        //check if thermometer was requested
        if(thermometer > -1){
            //based on example adc10_temp.c from URL: http://dev.ti.com/tirex/explore/node?node=AEldOKIXgnT979MckUlLRw__IOGqZri__LATEST
            if(!t_activated){
                ADC10CTL0 = ADC10ON + SREF_1 + REFON;      // ADC10ON, vr+ = Vref+f, Vr- = Vss, reference on,
                ADC10CTL1 = INCH_10 + ADC10SSEL_1;         // temp sensor, clock = ACLK
                //ADC10AE0 |= BIT1;                          // PA.1 ADC option select

                //set up a timer for stabilisation, use A1
                //need a 30microsecond delay calculation time was 0.49, putting 10 to test, need only 1 timer
                int counts[1] = {10};
                t_activated = activate_free_timer(1, counts);
                activated_temp[0] = activated_timers[0];      //record which ones were activated
                thermometer = activated_temp[0];              //Set for proper check in interrupts
                if (t_activated != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                }
            }

            if (sample_temp){
                ADC10CTL0 |= SREF_1;                //Set ref to 1
                ADC10CTL1 |= INCH_10;                //Ensure right channel
                ADC10CTL0 |= ENC + ADC10SC;         // Sampling and conversion start
                ADC10AE0 |= BIT1;                          // PA.1 ADC option select
                //based on code for pot above
                //ADC10MEM = conversion result
                while ((ADC10CTL1 & ADC10BUSY) == 1) {//check if busy
                    //Wait for sample to take place
                }
                temp = ADC10MEM;           //Just to make sure the value doesn't change during checking
                //reset ENC
                ADC10CTL0 &= ~ENC;
                value_temp = ((temp - 673) * 423) / 1024;

                if(value_temp != orig_temp){ //if value has changed
                    //check by how much
                    change_t = abs(orig_temp - value_temp);

                    if (change_t >= step_size_t){
                        //send message
                        //change to new orig value
                        orig_temp = value_temp;
                        //testing light
                        P1OUT ^= BIT0;
                    }
                }

                //set sample to false
                sample_temp = 0;
            }


        } else if(thermometer == -2){
            t_activated = 0;
            deactivate_timer(activated_temp, 1);
            thermometer = -1;
        }


        //Outputs
        //LED1
        //on/off
        if(led1_on == 1){
            if (!led1_active) {
              P1DIR |= BIT0;        // P1.0 output
            }

            //turn on LED D1
            P1OUT |= BIT0;
            //set the value to 0
            led1_on = 0;

        } else if(led1_on == -1) {
            P1OUT &= ~BIT0;         //turn light off
            led1_active = 0;        //not active anymore
            led1_on = 0;
        }

        //blinking
        if(led1_blink > -1){
            if(!led1_active){
                P1DIR |= BIT0;
                //need a timer for the blinking, only 1
                int counts[1] = {blink_rate_1};
                led1_active = activate_free_timer(1, counts);
                activated_led1[0] = activated_timers[0]; //record which ones were activated
                led1_blink = activated_led1[0];
                if (led1_active != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                }
                //toggle LED D1
                P1OUT ^= BIT0;
            }

        } else if (led1_blink == -2){
            led1_active = 0;
            P1OUT &= ~BIT0;
            deactivate_timer(activated_led1, 1);
            led1_blink = -1;
        }

        //fade in
        if(led1_fade_in > -1){
            if(!led1_active){
                P1DIR |= BIT0;
                P1OUT &= ~BIT0; //don't want it on
                //need 2 timers for the fading in
                int counts[2] = {change_period, period_1};
                led1_active = activate_free_timer(2, counts);
                activated_led1[0] = activated_timers[0]; //record which ones were activated, first
                activated_led1[1] = activated_timers[1]; //record second one
                led1_fade_in = get_timer_code(activated_led1);
                if (led1_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                }

