fraserb99/ee579-msp430/Group Project/main.c
            }

        } else if (led1_fade_in == -2){
            //led1_active = 0; - light is still active
            deactivate_timer(activated_led1, 2);
            led1_fade_in = -1;
        }

        //fade out
        if(led1_fade_out > -1){
            if(!led1_fo_active){ //if light hasn't been activated, or if on
                P1DIR |= BIT0;
                //need 2 timers for the fading in
                int counts[2] = {change_period, period_1};
                led1_fo_active = activate_free_timer(2, counts);
                activated_led1[0] = activated_timers[0]; //record which ones were activated, first
                activated_led1[1] = activated_timers[1]; //record second one
                led1_fade_out = get_timer_code(activated_led1);
                if (led1_fo_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                } else {
                    led1_active = 1; //led is being used
                }
                //for testing
                //P1OUT ^= BIT6;
                //set the brightness to max
                brightness_1 = max_brightness;
                light_flag_1 = 1;
                //need to turn on a light first, if not already on
                P1OUT |= BIT0;
            }

        } else if (led1_fade_out == -2){
            led1_fo_active = 0;
            led1_active = 0;
            P1OUT &= ~BIT0;
            deactivate_timer(activated_led1, 2);
            led1_fade_out = -1;
        }

        //breathing
        if(led1_breath > -1){
            if(!led1_active){
                P1DIR |= BIT0;
                //need 2 timers for the breathing light
                int counts[2] = {change_period, period_1};
                led1_active = activate_free_timer(2, counts);
                activated_led1[0] = activated_timers[0]; //record which ones were activated, first
                activated_led1[1] = activated_timers[1]; //record second one
                led1_breath = get_timer_code(activated_led1);
                if (led1_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                }
            }

        } else if (led1_breath == -2){
            led1_active = 0;
            P1OUT &= ~BIT0;
            deactivate_timer(activated_led1, 2);
            led1_breath = -1;
        }

        //LED2 on/off
        if(led2_on == 1){
            if (!led2_active) {
              P1DIR |= BIT6;        // P1.6 output
            }
            //turn on LED D2
            P1OUT |= BIT6;
            led2_on = 0;

        } else if(led2_on == -1){
            P1OUT &= ~BIT6;         //turn light off
            led2_active = 0;        //not active anymore
            led2_on = 0;
        }

        //blinking
        if(led2_blink > -1){
            if(!led2_active){
                P1DIR |= BIT6;
                //need a timer for the blinking, only 1
                int counts[1] = {blink_rate_1};
                led2_active = activate_free_timer(1, counts);
                activated_led2[0] = activated_timers[0]; //record which ones were activated
                led2_blink = activated_led2[0];
                if (led2_active != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                }
                //toggle LED D2
                P1OUT ^= BIT6;
            }

        } else if (led2_blink == -2){
            led2_active = 0;
            P1OUT &= ~ BIT6;
            deactivate_timer(activated_led2, 1);
            led2_blink = -1;
        }

        //fade in
        if(led2_fade_in > -1){
            if(!led2_active){
                P1DIR |= BIT6;
                P1OUT &= ~BIT6; //don't want it on
                //need 2 timers for the fading in
                int counts[2] = {change_period, period_2};
                led2_active = activate_free_timer(2, counts);
                activated_led2[0] = activated_timers[0]; //record which ones were activated, first
                activated_led2[1] = activated_timers[1]; //record second one
                led2_fade_in = get_timer_code(activated_led2);
                if (led2_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                }
            }

        } else if (led2_fade_in == -2){
            //led2_active = 0; - light is still active
            //P1OUT &= ~BIT6;
            deactivate_timer(activated_led2, 2);
            led2_fade_in = -1;
        }

        //fade out
        if(led2_fade_out > -1){
            if(!led2_fo_active){ //if light hasn't been activated, or if on
                P1DIR |= BIT6;
                //need 2 timers for the fading in
                int counts[2] = {change_period, period_2};
                led2_fo_active = activate_free_timer(2, counts);
                activated_led2[0] = activated_timers[0]; //record which ones were activated, first
                activated_led2[1] = activated_timers[1]; //record second one
                led2_fade_out = get_timer_code(activated_led2);
                if (led2_fo_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                } else {
                    led2_active = 1; //led is being used
                }
                //for testing
                //P1OUT ^= BIT6;
                //set the brightness to max
                brightness_2 = max_brightness;
                light_flag_2 = 1;
                //need to turn on a light first, if not already on
                P1OUT |= BIT6;
            }

        } else if (led2_fade_out == -2){
            led2_fo_active = 0;
            led2_active = 0;
            P1OUT &= ~BIT6;
            deactivate_timer(activated_led2, 2);
            led2_fade_out = -1;
        }

