fraserb99/ee579-msp430/Group Project/main.c
        //breathing
        if(led2_breath > -1){
            if(!led2_active){
                P1DIR |= BIT6;
                //need 2 timers for the breathing light
                int counts[2] = {change_period, period_2};
                led2_active = activate_free_timer(2, counts);
                activated_led2[0] = activated_timers[0]; //record which ones were activated, first
                activated_led2[1] = activated_timers[1]; //record second one
                led2_breath = get_timer_code(activated_led2);
                if (led2_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                }
            }

        } else if (led2_breath == -2){
            led2_active = 0;
            P1OUT &= ~BIT6;
            deactivate_timer(activated_led2, 2);
            led2_breath = -1;
        }

        //LED3 on/off
        if(led3_on == 1){
            if (!led3_active) {
              P2DIR |= BIT1 + BIT3 + BIT5;        // P1.0 output
            }

            //LED D3, on set colour
            P2OUT = colours[colour];
            led3_on = 0;

        } else if(led3_on == -1){
            P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
            led3_active = 0;                    //not active anymore
            led3_on = 0;
        }

        //circling
        if(led3_rot > -1){
            if(!led3_active){
                P2DIR |= BIT1 + BIT3 + BIT5;
                //need a timer for the rotation speed, only 1
                int counts[1] = {blink_rate_3};
                led3_active = activate_free_timer(1, counts);
                activated_led3[0] = activated_timers[0]; //record which ones were activated
                led3_rot = activated_led3[0];
                if (led3_active != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                }
                //toggle LED D3, wanted colour
                P2OUT = colours[colour];
            }

        } else if(led3_rot == -2){
            led3_active = 0;
            P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
            deactivate_timer(activated_led3, 1);
            led3_rot = -1;

        }

        //blinking
        if(led3_blink > -1){
            if(!led3_active){
                P2DIR |= BIT1 + BIT3 + BIT5;
                //need a timer for the rotation speed, only 1
                int counts[1] = {blink_rate_3};
                led3_active = activate_free_timer(1, counts);
                activated_led3[0] = activated_timers[0]; //record which ones were activated
                led3_blink = activated_led3[0];
                if (led3_active != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                }
                //toggle LED D3, with start colour
                P2OUT = colours[colour];
                //indicate on
                led3_blink_on = 1;
            }

        } else if(led3_blink == -2){
            led3_active = 0;
            P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
            deactivate_timer(activated_led3, 1);
            led3_blink = -1;
        }

        //fade in
        if(led3_fade_in > -1){
            if(!led3_active){
                P2DIR |= BIT1 + BIT3 + BIT5;
                P2OUT &= ~(BIT1 + BIT3 + BIT5); //don't want it on
                //need 2 timers for the fading in
                int counts[2] = {change_period, period_3};
                led3_active = activate_free_timer(2, counts);
                activated_led3[0] = activated_timers[0]; //record which ones were activated, first
                activated_led3[1] = activated_timers[1]; //record second one
                led3_fade_in = get_timer_code(activated_led3);
                if (led3_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                }
            }

        } else if (led3_fade_in == -2){
            //led3_active = 0;
            //P2OUT &= ~(BIT1 + BIT3 + BIT5);
            deactivate_timer(activated_led3, 2);
            led3_fade_in = -1;
        }

        //fade out
        if(led3_fade_out > -1){
            if(!led3_fo_active){ //if light hasn't been activated, or if on
                P2DIR |= BIT1 + BIT3 + BIT5;
                //need 2 timers for the fading in
                int counts[2] = {change_period, period_3};
                led3_fo_active = activate_free_timer(2, counts);
                activated_led3[0] = activated_timers[0]; //record which ones were activated, first
                activated_led3[1] = activated_timers[1]; //record second one
                led3_fade_out = get_timer_code(activated_led3);
                if (led3_fo_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                } else {
                    led3_active = 1; //led is being used
                }
                //for testing
                //P1OUT ^= BIT6;
                //set the brightness to max
                brightness_3 = max_brightness;
                light_flag_3 = 1;
                //need to turn on a light first, if not already on, on the specified colour
                P2OUT |= colours[colour];
            }

        } else if (led3_fade_out == -2){
            led3_fo_active = 0;
            led3_active = 0;
            P2OUT &= ~(BIT1 + BIT3 + BIT5);
            deactivate_timer(activated_led3, 2);
            led3_fade_out = -1;
        }

        //breathing
        if(led3_breath > -1){
            if(!led3_active){
                P2DIR |= BIT1 + BIT3 + BIT5;
                //need 2 timers for the breathing light
                int counts[2] = {change_period, period_3};
                led3_active = activate_free_timer(2, counts);
                activated_led3[0] = activated_timers[0]; //record which ones were activated, first
                activated_led3[1] = activated_timers[1]; //record second one
                led3_breath = get_timer_code(activated_led3);
                if (led3_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                }
            }

        } else if (led3_breath == -2){
            led3_active = 0;
            P2OUT &= ~(BIT1 + BIT3 + BIT5); //turn off the light
            deactivate_timer(activated_led3, 2);
            led3_breath = -1;
        }

        //Buzzer for specified duration
        if(buzzer_tone > -1){
            if(!buzzer_active){ //if it's not been activated
                //activate the pins used
                P2DIR |= BIT2 + BIT4;
                P2OUT |= BIT2;     //ensure one is on, the other off
                P2OUT &= ~ BIT4;
                buzzer_count = 0;   //ensure this is at 0;
                buzzer_duration = buzzer_duration/5; //ensure duration is proper
                //need to have 1 timer
                int counts[1] = {buzzer_period};
                buzzer_active = activate_free_timer(1, counts);
                activated_buzzer[0] = activated_timers[0]; //record which one were activated
                buzzer_tone = activated_buzzer[0]; //get the timer
                if (buzzer_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                }
            }
        } else if (buzzer_tone == -2){
            buzzer_active = 0;  //no longer on
            P2OUT &= ~BIT2;
            P2OUT &= ~BIT4;
            deactivate_timer(activated_buzzer, 1);
            buzzer_tone = -1;
        }

