fraserb99/ee579-msp430/Group Project/main.c
        //Buzzer beeping
        if(buzzer_beep > -1){
            if(!buzzer_active){ //if it's not been activated
                //activate the pins used
                P2DIR |= BIT2 + BIT4;
                P2OUT |= BIT2;     //ensure one is on, the other off
                P2OUT &= ~ BIT4;
                buzzer_count = 0;   //ensure this is at 0;
                buzzer_duration = 400; //ensure duration is proper
                buzzer_duration_off = buzzer_duration_off/5; //ensure duration is proper
                //need to have 1 timer
                int counts[1] = {buzzer_period};
                buzzer_active = activate_free_timer(1, counts);
                activated_buzzer[0] = activated_timers[0]; //record which one were activated
                buzzer_beep = activated_buzzer[0];
                if (buzzer_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                }
            }

        } else if (buzzer_beep == -2){
            buzzer_active = 0;  //no longer on
            P2OUT &= ~BIT2;
            P2OUT &= ~BIT4;
            deactivate_timer(activated_buzzer, 1);
            buzzer_beep= -1;
        }

    }
}

//interrupts, duplicated code to allow for the optimum timer usage
//timer A0
#pragma vector=TIMER0_A0_VECTOR
__interrupt void Timer0_A0 (void)
{
    //check for how long button was pressed
    if ((button == 0) && (held == 1)) {
        if ((held == 1) && !(P1IN & BIT3)) { //check how long its being held for
            timerCount += 1;

        } else if ((held == 1) && (P1IN & BIT3)){   //if button was released
            //send timer count signal here
            //led1_fade_out = 1;
            //testing with light first
            //P1OUT ^= BIT6;
            buzzer_beep = -2;
            held = 0;                               //button has now been released
        }
        //offset TA0CCR0 by the count number/period
        TA0CCR0 += count_b;
    } else if (button == 0){ //check that it is the button debouncing
        if ((pressed == 1) && !(P1IN & BIT3)){   //button was pressed properly
             timerCount = 0;                     //Reset the timer count
             pressed = 0;                        //reset pressed
             held = 1;                           //Button is being held
             //P1OUT ^= BIT6;
             //offset TA0CCR0 by the count number/period
             //change the value held in the array
             timers_used[0] = count_b;
             TA0CCR0 += count_b;

        } else {
            pressed = 0;                         //Button is not being pressed
        }

     }

    //button 2, copied code
    if ((button2 == 0) && (held2 == 1)) {
        if ((held2 == 1) && !(P1IN & BIT5)) { //check how long its being held for
            timerCount2 += 1;

        } else if ((held2 == 1) && (P1IN & BIT5)){   //if button was released
            //send timer count signal here
            //testing with light first
            //P1OUT ^= BIT0;
            held2 = 0;                               //button has now been released
        }
        //offset TA0CCR0 by the count number/period
        TA0CCR0 += count_b2;
    } else if (button2 == 0){ //check that it is the button debouncing
        if ((pressed2 == 1) && !(P1IN & BIT5)){   //button was pressed properly
             timerCount2 = 0;                     //Reset the timer count
             pressed2 = 0;                        //reset pressed
             held2 = 1;                           //Button is being held
             //P1OUT ^= BIT6;

             //change the value held in the array
             timers_used[0] = count_b2;
             TA0CCR0 += count_b2;

        } else {
            pressed2 = 0;                         //Button is not being pressed
        }

     }

    //thermometer stuff
    if(thermometer == 0){
        if (!stable){
            stable = 1;
            //get original value, if possible here
            ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
            temp = ADC10MEM;
            // oC = ((A10/1024)*1500mV)-986mV)*1/3.55mV = A10*423/1024 - 278, taken from example
            orig_temp = ((temp - 673) * 423) / 1024;
            timers_used[0] = sample_temp_time;
            TA0CCR0 += sample_temp_time;

        } else {
            sample_temp = 1;        //start a sample
        }

        TA0CCR0 += sample_temp_time;
    }

    //outputs
    //LED1 blinking
    if(led1_blink == 0){
        P1OUT ^= BIT0;
        TA0CCR0 += blink_rate_1;
    }

    //fading in/out and breathing, part 1, can be 10, 11, 12, 13, 14
    if(((led1_fade_in >= 10) && (led1_fade_in <= 14)) || ((led1_fade_out >= 10) && (led1_fade_out <= 14)) || ((led1_breath >= 10) && (led1_breath <= 14))){
        if(counter_val_1 < brightness_1){
            P1OUT |= BIT0;                              //Turn on light
        } else {
            P1OUT &= ~BIT0;
        }
        counter_val_1 += 1;                             //Increment the value to read from the array

        if(counter_val_1 >= max_brightness){                       //reached max value, reset
            counter_val_1 = 0;
        }
        TA0CCR0 += change_period;
    }

    //LED2 blinking
    if(led2_blink == 0){
        P1OUT ^= BIT6;
        TA0CCR0 += blink_rate_2;
    }

    //fading in/out and breathing, part 1, can be 10, 11, 12, 13, 14
    if(((led2_fade_in >= 10) && (led2_fade_in <= 14)) || ((led2_fade_out >= 10) && (led2_fade_out <= 14)) || ((led2_breath >= 10) && (led2_breath <= 14))){
        if(counter_val_2 < brightness_2){
            P1OUT |= BIT6;                              //Turn on light
        } else {
            P1OUT &= ~BIT6;
        }
        counter_val_2 += 1;                             //Increment the value to read from the array

        if(counter_val_2 >= max_brightness){                       //reached max value, reset
            counter_val_2 = 0;
        }
        TA0CCR0 += change_period;
    }

    //LED3 rotating
    if(led3_rot == 0){
        //verify boundaries
        if ((colour == 0) && (led3_dir == -1)){
            colour = 6;
        } else if ((colour == 6) && (led3_dir == 1)){
            colour = 0;
        } else {
            colour = colour + led3_dir; //change colour based on direction
        }
        //swap colour
        P2OUT = colours[colour];
        TA0CCR0 += blink_rate_3;
    }
    //LED3 blink
    if(led3_blink == 0){
        if(led3_blink_on){
            P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
            led3_blink_on = 0;
            TA0CCR0 += blink_rate_3;
        } else {
            if ((colour == 0) && (led3_dir == -1)){
                colour = 6;
            } else if ((colour == 6) && (led3_dir == 1)){
                colour = 0;
            } else {
                colour = colour + led3_dir; //change colour based on direction
            }
            led3_blink_on = 1;
            //swap colour
            P2OUT = colours[colour];
            TA0CCR0 += blink_rate_3;
        }
    }

    //fading in/out and breathing, part 1, can be 10, 11, 12, 13, 14
    if(((led3_fade_in >= 10) && (led3_fade_in <= 14)) || ((led3_fade_out >= 10) && (led3_fade_out <= 14)) || ((led3_breath >= 10) && (led3_breath <= 14))){
        if(counter_val_3 < brightness_3){
            P2OUT |= colours[colour];                              //Turn on light
        } else {
            P2OUT &= ~(BIT1 + BIT3 + BIT5);
        }
        counter_val_3 += 1;                             //Increment the value to read from the array

