fraserb99/ee579-msp430/Group Project/main.c
        if(counter_val_3 >= max_brightness){                       //reached max value, reset
            counter_val_3 = 0;
        }
        TA0CCR0 += change_period;
    }

    //Buzzer, tone for specific duration
    if(buzzer_tone == 0){
        buzzer_count += 1;  //increment count
        //alternate the pins
        P2OUT ^= BIT2;
        P2OUT ^= BIT4;

        //check if less or greater than the wanted duration
        if(buzzer_count >= buzzer_duration){
            buzzer_tone = -2; //turn it off
        }

        TA0CCR0 += buzzer_period;
    }

    //buzzer beeping
    if(buzzer_beep == 0){
        buzzer_count += 1;  //increment count

        if(buzzer_on) { //if it is on, alternate
            //alternate the pins
            P2OUT ^= BIT2;
            P2OUT ^= BIT4;
            //check if less or greater than the wanted duration
            if(buzzer_count >= buzzer_duration){
                buzzer_on = 0; //turn off
                buzzer_count = 0; //reset count
            }

        } else { //if off, turn both off
            P2OUT &= ~BIT2;
            P2OUT &= ~BIT4;

            //check if less or greater than the wanted duration
            if(buzzer_count >= buzzer_duration_off){
                buzzer_on= 1; //turn it on
                //buzzer count reset
                buzzer_count = 0;
                //turn one of them on
                P2OUT |= BIT2;
            }

        }


        TA0CCR0 += buzzer_period;
    }
}

//interrupt for timer A0
#pragma vector=TIMER0_A1_VECTOR
__interrupt void Timer0_A1(void){
    switch(TA0IV)
    {
    case  2:
        //check for how long button was pressed
        if ((button == 1) && (held == 1)) {
            if ((held == 1) && !(P1IN & BIT3)) { //check how long its being held for
                timerCount += 1;

            } else if ((held == 1) && (P1IN & BIT3)){   //if button was released
                //send timer count signal here
                led3_rot = 1;
                //testing with light first
               // P1OUT ^= BIT0;
                held = 0;                               //button has now been released
            }
            //offset TA0CCR1 by the count number/period
            TA0CCR1 += count_b;
        } else if (button == 1){ //check that it is the button debouncing
            if ((pressed == 1) && !(P1IN & BIT3)){   //button was pressed properly
                 timerCount = 0;                     //Reset the timer count
                 pressed = 0;                        //reset pressed
                 held = 1;                           //Button is being held
                 P1OUT ^= BIT6;
                 //offset TA0CCR0 by the count number/period
                 //change the value held in the array
                 timers_used[0] = count_b;
                 TA0CCR1 += count_b;

            } else {
                pressed = 0;                         //Button is not being pressed
            }

         }

        //button 2, copied code
        if ((button2 == 1) && (held2 == 1)) {
            if ((held2 == 1) && !(P1IN & BIT5)) { //check how long its being held for
                timerCount2 += 1;

            } else if ((held2 == 1) && (P1IN & BIT5)){   //if button was released
                //send timer count signal here
                //testing with light first
                P1OUT ^= BIT0;
                held2 = 0;                               //button has now been released
            }
            //offset TA0CCR1 by the count number/period
            TA0CCR1 += count_b2;
        } else if (button2 == 1){ //check that it is the button debouncing
            if ((pressed2 == 1) && !(P1IN & BIT5)){   //button was pressed properly
                 timerCount2 = 0;                     //Reset the timer count
                 pressed2 = 0;                        //reset pressed
                 held2 = 1;                           //Button is being held
                 P1OUT ^= BIT0;
                 //offset TA0CCR0 by the count number/period
                 //change the value held in the array
                 timers_used[0] = count_b2;
                 TA0CCR1 += count_b2;

            } else {
                pressed2 = 0;                         //Button is not being pressed
            }

         }


        //thermometer stuff
        if(thermometer == 1){
            if (!stable){
                stable = 1;
                //get original value, if possible here
                ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
                temp = ADC10MEM;
                // oC = ((A10/1024)*1500mV)-986mV)*1/3.55mV = A10*423/1024 - 278, taken from example
                orig_temp = ((temp - 673) * 423) / 1024;

            } else {
                sample_temp = 1;        //start a sample
            }

            TA0CCR1 += sample_temp_time;
        }

        //outputs
        //LED1 blinking
        if(led1_blink == 1){
            P1OUT ^= BIT0;
            TA0CCR1 += blink_rate_1;
        }

        //fading in/out and breathing, part 1, can be 15, 16, 17, or 18
        if(((led1_fade_in >= 15) && (led1_fade_in <= 18)) || ((led1_fade_out >= 15) && (led1_fade_out <= 18)) || ((led1_breath >= 15) && (led1_breath <= 18))){
            if(counter_val_1 < brightness_1){
                P1OUT |= BIT0;                              //Turn on light
            } else {
                P1OUT &= ~BIT0;
            }
            counter_val_1 += 1;                             //Increment the value to read from the array

            if(counter_val_1 >= max_brightness){                       //reached max value, reset
                counter_val_1 = 0;
            }
            TA0CCR1 += change_period;
        }

        //fade in part 2
        if(led1_fade_in == 10) {
            if(light_flag_1 == 0){
                brightness_1 += 1;                //increase brightness
            }

            if(brightness_1 == max_brightness){               //if max brightness
                P1OUT |= BIT0;             //leave it on
                led1_fade_in = -2;          //completed task
            }

            TA0CCR1 += period_1;
        }

