fraserb99/ee579-msp430/Group Project/main.c
        //fade out part 2
        if(led1_fade_out == 10) {
            if(light_flag_1 == 1) {
                brightness_1 -= 1;                //decrease brightness
            }

             if (brightness_1 == 0) {       //reached lowest value
                P1OUT &= ~BIT0;                 //keep light off
                led1_fade_out = -2;          //completed task, deactivate it
            }

            TA0CCR1 += period_1;
        }

        //breathing part 2
        if(led1_breath == 10){
            if(light_flag_1 == 0){
                brightness_1 += 1;                //increase brightness
            } else {
                brightness_1 -= 1;                //decrease brightness
            }

            if(brightness_1 == max_brightness){               //if max brightness
                light_flag_1 = 1;                //set to decrease
            } else if (brightness_1 == 0) {       //reached lowest value
                light_flag_1 = 0;                //increase light
            }

            TA0CCR1 += period_1;
        }

        //LED2 blinking
        if(led2_blink == 1){
            P1OUT ^= BIT6;
            TA0CCR1 += blink_rate_2;
        }

        //fading in/out and breathing, part 1, can be 15, 16, 17, or 18
        if(((led2_fade_in >= 15) && (led2_fade_in <= 18)) || ((led2_fade_out >= 15) && (led2_fade_out <= 18)) || ((led2_breath >= 15) && (led2_breath <= 18))){
            if(counter_val_2 < brightness_2){
                P1OUT |= BIT6;                              //Turn on light
            } else {
                P1OUT &= ~BIT6;
            }
            counter_val_2 += 1;                             //Increment the value to read from the array

            if(counter_val_2 >= max_brightness){                       //reached max value, reset
                counter_val_2 = 0;
            }
            TA0CCR1 += change_period;
        }

        //fade in part 2
        if(led2_fade_in == 10) {
            if(light_flag_2 == 0){
                brightness_2 += 1;                //increase brightness
            }

            if(brightness_2 == max_brightness){               //if max brightness
                P1OUT |= BIT6;             //leave it on
                led2_fade_in = -1;          //completed task
            }

            TA0CCR1 += period_2;
        }

        //fade out part 2
        if(led2_fade_out == 10) {
            if(light_flag_2 == 1) {
                brightness_2 -= 1;                //decrease brightness
            }

             if (brightness_2 == 0) {       //reached lowest value
                P1OUT &= ~BIT6;                 //keep light off
                led2_fade_out = -2;          //completed task, deactivate it
            }

            TA0CCR1 += period_2;
        }

        //breathing part 2
        if(led2_breath == 10){
            if(light_flag_2 == 0){
                brightness_2 += 1;                //increase brightness
            } else {
                brightness_2 -= 1;                //decrease brightness
            }

            if(brightness_2 == max_brightness){               //if max brightness
                light_flag_2 = 1;                //set to decrease
            } else if (brightness_2 == 0) {       //reached lowest value
                light_flag_2 = 0;                //increase light
            }

            TA0CCR1 += period_2;
        }

        //LED3 rotating
        if(led3_rot == 1){
            //verify boundaries
            if ((colour == 0) && (led3_dir == -1)){
                colour = 6;
            } else if ((colour == 6) && (led3_dir == 1)){
                colour = 0;
            } else {
                colour = colour + led3_dir; //change colour based on direction
            }
            //swap colour
            P2OUT = colours[colour];
            TA0CCR1 += blink_rate_3;
        }
        //LED3 blink
        if(led3_blink == 1){
            if(led3_blink_on){
                P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
                led3_blink_on = 0;
                TA0CCR1 += blink_rate_3;
            } else {
                if ((colour == 0) && (led3_dir == -1)){
                    colour = 6;
                } else if ((colour == 6) && (led3_dir == 1)){
                    colour = 0;
                } else {
                    colour = colour + led3_dir; //change colour based on direction
                }
                led3_blink_on = 1;
                //swap colour
                P2OUT = colours[colour];
                TA0CCR1 += blink_rate_3;
            }
        }

        //fading in/out and breathing, part 1, can be 15, 16, 17, or 18
        if(((led3_fade_in >= 15) && (led3_fade_in <= 18)) || ((led3_fade_out >= 15) && (led3_fade_out <= 18)) || ((led3_breath >= 15) && (led3_breath <= 18))){
            if(counter_val_3 < brightness_3){
                P2OUT |= colours[colour];                              //Turn on light
            } else {
                P2OUT &= ~(BIT1 + BIT3 + BIT5);
            }
            counter_val_3 += 1;                             //Increment the value to read from the array

            if(counter_val_3 >= max_brightness){                       //reached max value, reset
                counter_val_3 = 0;
            }
            TA0CCR1 += change_period;
        }

        //fade in part 2
        if(led3_fade_in == 10) {
            if(light_flag_3 == 0){
                brightness_3 += 1;                //increase brightness
            }

            if(brightness_3 == max_brightness){               //if max brightness
                P2OUT |= colours[colour];             //leave it on
                led3_fade_in = -1;          //completed task
            }

            TA0CCR1 += period_3;
        }

        //fade out part 2
        if(led3_fade_out == 10) {
            if(light_flag_3 == 1) {
                brightness_3 -= 1;                //decrease brightness
            }

             if (brightness_3 == 0) {       //reached lowest value
                P2OUT &= ~(BIT1 + BIT3 + BIT5);                 //keep light off
                led3_fade_out = -2;          //completed task, deactivate it
            }

            TA0CCR1 += period_3;
        }

        //breathing part 2
        if(led3_breath == 10){
            if(light_flag_3 == 0){
                brightness_3 += 1;                //increase brightness
            } else {
                brightness_3 -= 1;                //decrease brightness
            }

            if(brightness_3 == max_brightness){               //if max brightness
                light_flag_3 = 1;                //set to decrease
            } else if (brightness_3 == 0) {       //reached lowest value
                light_flag_3 = 0;                //increase light
                //change colour
                //verify boundaries
                if ((colour == 0) && (led3_dir == -1)){
                    colour = 6;
                } else if ((colour == 6) && (led3_dir == 1)){
                    colour = 0;
                } else {
                    colour = colour + led3_dir; //change colour based on direction
                }
            }

            TA0CCR1 += period_3;
        }

        //Buzzer tone
        if(buzzer_tone == 1){
            buzzer_count += 1;  //increment count
            //alternate the pins
            P2OUT ^= BIT2;
            P2OUT ^= BIT4;

