fraserb99/ee579-msp430/Group Project/main.c
        //buzzer
        if(buzzer_tone == 2){
            buzzer_count += 1;  //increment count
            //alternate the pins
            P2OUT ^= BIT2;
            P2OUT ^= BIT4;

            //check if less or greater than the wanted duration
            if(buzzer_count >= buzzer_duration){
                buzzer_tone = -2; //turn it off
            }

            TA0CCR2 += buzzer_period;
        }

        //buzzer beeping
        if(buzzer_beep == 2){
            buzzer_count += 1;  //increment count

            if(buzzer_on) { //if it is on, alternate
                //alternate the pins
                P2OUT ^= BIT2;
                P2OUT ^= BIT4;
                //check if less or greater than the wanted duration
                if(buzzer_count >= buzzer_duration){
                    buzzer_on = 0; //turn off
                    buzzer_count = 0; //reset count
                }

            } else { //if off, turn both off
                P2OUT &= ~BIT2;
                P2OUT &= ~BIT4;

                //check if less or greater than the wanted duration
                if(buzzer_count >= buzzer_duration_off){
                    buzzer_on= 1; //turn it on
                    //buzzer count reset
                    buzzer_count = 0;
                    //turn one of them on
                    P2OUT |= BIT2;
                }

            }


            TA0CCR2 += buzzer_period;
        }

        break;

    case 10: break;                             //Timer_A3 overflow, don't need to do anything

    }

}

//Interrupt for time A1
#pragma vector=TIMER1_A0_VECTOR
__interrupt void Timer1_A0 (void)
{
    //button stuff
    //check for how long button was pressed
    if ((button == 3) && (held == 1)) {
        if ((held == 1) && !(P1IN & BIT3)) { //check how long its being held for
            timerCount += 1;

        } else if ((held == 1) && (P1IN & BIT3)){   //if button was released
            //send timer count signal here
            led1_blink = 1;
            //testing with light first
           // P1OUT ^= BIT0;
            held = 0;                               //button has now been released
        }
        //offset TA0CCR0 by the count number/period
        TA1CCR0 += count_b;
    } else if (button == 3){ //check that it is the button debouncing
        if ((pressed == 1) && !(P1IN & BIT3)){   //button was pressed properly
             timerCount = 0;                     //Reset the timer count
             pressed = 0;                        //reset pressed
             held = 1;                           //Button is being held
             P1OUT ^= BIT6;
             //offset TA0CCR0 by the count number/period
             //change the value held in the array
             timers_used[0] = count_b;
             TA1CCR0 += count_b;

        } else {
            pressed = 0;                         //Button is not being pressed
        }

     }

    //button 2, copied code
    if ((button2 == 3) && (held2 == 1)) {
        if ((held2 == 1) && !(P1IN & BIT5)) { //check how long its being held for
            timerCount2 += 1;

        } else if ((held2 == 1) && (P1IN & BIT5)){   //if button was released
            //send timer count signal here

            held2 = 0;                               //button has now been released
        }
        //offset TA0CCR0 by the count number/period
        TA1CCR0 += count_b2;
    } else if (button2 == 3){ //check that it is the button debouncing
        if ((pressed2 == 1) && !(P1IN & BIT5)){   //button was pressed properly
             timerCount2 = 0;                     //Reset the timer count
             pressed2 = 0;                        //reset pressed
             held2 = 1;                           //Button is being held
             //change the value held in the array
             timers_used[0] = count_b2;
             TA1CCR0 += count_b2;

        } else {
            pressed2 = 0;                         //Button is not being pressed
        }

     }


    //thermometer stuff
    if(thermometer == 3){
        if (!stable){
            stable = 1;
            //get original value, if possible here
            ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
            temp = ADC10MEM;
            // oC = ((A10/1024)*1500mV)-986mV)*1/3.55mV = A10*423/1024 - 278, taken from example
            orig_temp = ((temp - 673) * 423) / 1024;

        } else {
            sample_temp = 1;        //start a sample
        }

        TA1CCR0 += sample_temp_time;
    }
    //outputs
    //LED1 blinking
    if(led1_blink == 3){
        P1OUT ^= BIT0;
        TA1CCR0 += blink_rate_1;
    }

    //fading in/out and breathing, part 1, can be 22 or 23
    if(((led1_fade_in == 22) && (led1_fade_in == 23)) || ((led1_fade_out == 22) && (led1_fade_out == 23)) || ((led1_breath == 22) && (led1_breath == 23))){
        if(counter_val_1 < brightness_1){
            P1OUT |= BIT0;                              //Turn on light
        } else {
            P1OUT &= ~BIT0;
        }
        counter_val_1 += 1;                             //Increment the value to read from the array

        if(counter_val_1 >= max_brightness){                       //reached max value, reset
            counter_val_1 = 0;
        }
        TA1CCR0 += change_period;
    }

    //fade in part 2
    if((led1_fade_in == 12) || (led1_fade_in == 16) || (led1_fade_in == 19)) {
        if(light_flag_1 == 0){
            brightness_1 += 1;                //increase brightness
        }

        if(brightness_1 == max_brightness){               //if max brightness
            P1OUT |= BIT0;             //leave it on
            led1_fade_in = -1;          //completed task
        }

        TA1CCR0 += period_1;
    }

    //fade out part 2
    if((led1_fade_out == 12) || (led1_fade_out == 16) || (led1_fade_out == 19)) {
        if(light_flag_1 == 1) {
            brightness_1 -= 1;                //decrease brightness
        }

         if (brightness_1 == 0) {       //reached lowest value
            P1OUT &= ~BIT0;                 //keep light off
            led1_fade_out = -2;          //completed task, deactivate it
        }

