fraserb99/ee579-msp430/Group Project/main.c
        //check if less or greater than the wanted duration
        if(buzzer_count >= buzzer_duration){
            buzzer_tone = -2; //turn it off
        }

        TA1CCR0 += buzzer_period;
    }

    //buzzer beeping
    if(buzzer_beep == 3){
        buzzer_count += 1;  //increment count

        if(buzzer_on) { //if it is on, alternate
            //alternate the pins
            P2OUT ^= BIT2;
            P2OUT ^= BIT4;
            //check if less or greater than the wanted duration
            if(buzzer_count >= buzzer_duration){
                buzzer_on = 0; //turn off
                buzzer_count = 0; //reset count
            }

        } else { //if off, turn both off
            P2OUT &= ~BIT2;
            P2OUT &= ~BIT4;

            //check if less or greater than the wanted duration
            if(buzzer_count >= buzzer_duration_off){
                buzzer_on= 1; //turn it on
                //buzzer count reset
                buzzer_count = 0;
                //turn one of them on
                P2OUT |= BIT2;
            }

        }


        TA1CCR0 += buzzer_period;
    }
}

//interrupt for timerA1
#pragma vector=TIMER1_A1_VECTOR
__interrupt void Timer1_A1(void){
    switch(TA1IV)
    {
    case  2:
        //check for how long button was pressed
        if ((button == 4) && (held == 1)) {
            if ((held == 1) && !(P1IN & BIT3)) { //check how long its being held for
                timerCount += 1;

            } else if ((held == 1) && (P1IN & BIT3)){   //if button was released
                //send timer count signal here
                led1_blink = 1;
                //testing with light first
               // P1OUT ^= BIT0;
                held = 0;                               //button has now been released
            }
            //offset TA1CCR1 by the count number/period
            TA1CCR1 += count_b;
        } else if (button == 4){ //check that it is the button debouncing
            if ((pressed == 1) && !(P1IN & BIT3)){   //button was pressed properly
                 timerCount = 0;                     //Reset the timer count
                 pressed = 0;                        //reset pressed
                 held = 1;                           //Button is being held
                 P1OUT ^= BIT6;
                 //offset TA0CCR0 by the count number/period
                 //change the value held in the array
                 timers_used[0] = count_b;
                 TA1CCR1 += count_b;

            } else {
                pressed = 0;                         //Button is not being pressed
            }

         }

        //button 2, copied code
        if ((button2 == 4) && (held2 == 1)) {
            if ((held2 == 1) && !(P1IN & BIT5)) { //check how long its being held for
                timerCount2 += 1;

            } else if ((held2 == 1) && (P1IN & BIT5)){   //if button was released
                //send timer count signal here
                held2 = 0;                               //button has now been released
            }
            //offset TA0CCR0 by the count number/period
            TA1CCR1 += count_b2;
        } else if (button2 == 4){ //check that it is the button debouncing
            if ((pressed2 == 1) && !(P1IN & BIT5)){   //button was pressed properly
                 timerCount2 = 0;                     //Reset the timer count
                 pressed2 = 0;                        //reset pressed
                 held2 = 1;                           //Button is being held
                 //change the value held in the array
                 timers_used[0] = count_b2;
                 TA1CCR1 += count_b2;

            } else {
                pressed2 = 0;                         //Button is not being pressed
            }

         }

        //outputs
        //LED1 blinking
        if(led1_blink == 4){
            P1OUT ^= BIT0;
            TACCR1 += blink_rate_1;
        }

        //fading in/out and breathing, part 1, can be 24
        if((led1_fade_in == 22) || (led1_fade_out == 24) || (led1_breath == 24)){
            if(counter_val_1 < brightness_1){
                P1OUT |= BIT0;                              //Turn on light
            } else {
                P1OUT &= ~BIT0;
            }
            counter_val_1 += 1;                             //Increment the value to read from the array

            if(counter_val_1 >= max_brightness){                       //reached max value, reset
                counter_val_1 = 0;
            }
            TA1CCR1 += change_period;
        }

        //fade in part 2
        if((led1_fade_in == 13) || (led1_fade_in == 17) || (led1_fade_in == 20) || (led1_fade_in == 22)) {
            if(light_flag_1 == 0){
                brightness_1 += 1;                //increase brightness
            }

            if(brightness_1 == max_brightness){               //if max brightness
                P1OUT |= BIT0;             //leave it on
                led1_fade_in = -1;          //completed task
            }

            TA1CCR1 += period_1;
        }

        //fade out part 2
        if((led1_fade_out == 13) || (led1_fade_out == 17) || (led1_fade_out == 20) || (led1_fade_out == 22)) {
            if(light_flag_1 == 1) {
                brightness_1 -= 1;                //decrease brightness
            }

             if (brightness_1 == 0) {       //reached lowest value
                P1OUT &= ~BIT0;                 //keep light off
                led1_fade_out = -2;          //completed task, deactivate it
            }

            TA1CCR1 += period_1;
        }

        //breathing part 2
        if((led1_breath == 13) || (led1_breath == 17) || (led1_breath == 20) || (led1_breath == 22)){
            if(light_flag_1 == 0){
                brightness_1 += 1;                //increase brightness
            } else {
                brightness_1 -= 1;                //decrease brightness
            }

            if(brightness_1 == max_brightness){               //if max brightness
                light_flag_1 = 1;                //set to decrease
            } else if (brightness_1 == 0) {       //reached lowest value
                light_flag_1 = 0;                //increase light
            }

            TA1CCR1 += period_1;
        }

        //LED2 blinking
        if(led2_blink == 4){
            P1OUT ^= BIT6;
            TA1CCR1 += blink_rate_2;
        }

        //fading in/out and breathing, part 1, can be 24
        if((led2_fade_in == 22) || (led2_fade_out == 24) || (led2_breath == 24)){
            if(counter_val_2 < brightness_2){
                P1OUT |= BIT6;                              //Turn on light
            } else {
                P1OUT &= ~BIT6;
            }
            counter_val_2 += 1;                             //Increment the value to read from the array

            if(counter_val_2 >= max_brightness){                       //reached max value, reset
                counter_val_2 = 0;
            }
            TA1CCR1 += change_period;
        }

        //fade in part 2
        if((led2_fade_in == 13) || (led2_fade_in == 17) || (led2_fade_in == 20) || (led2_fade_in == 22)) {
            if(light_flag_2 == 0){
                brightness_2 += 1;                //increase brightness
            }

            if(brightness_2 == max_brightness){               //if max brightness
                P1OUT |= BIT6;             //leave it on
                led2_fade_in = -1;          //completed task
            }

            TA1CCR1 += period_2;
        }

