fraserb99/ee579-msp430/Group Project/main.c
        //fade out part 2
        if((led2_fade_out == 13) || (led2_fade_out == 17) || (led2_fade_out == 20) || (led2_fade_out == 22)) {
            if(light_flag_2 == 1) {
                brightness_2 -= 1;                //decrease brightness
            }

             if (brightness_2 == 0) {       //reached lowest value
                P1OUT &= ~BIT6;                 //keep light off
                led2_fade_out = -2;          //completed task, deactivate it
            }

            TA1CCR1 += period_2;
        }

        //breathing part 2
        if((led2_breath == 13) || (led2_breath == 17) || (led2_breath == 20) || (led2_breath == 22)){
            if(light_flag_2 == 0){
                brightness_2 += 1;                //increase brightness
            } else {
                brightness_2 -= 1;                //decrease brightness
            }

            if(brightness_2 == max_brightness){               //if max brightness
                light_flag_2 = 1;                //set to decrease
            } else if (brightness_2 == 0) {       //reached lowest value
                light_flag_2 = 0;                //increase light
            }

            TA1CCR1 += period_2;
        }

        //LED3 rotating
        if(led3_rot == 4){
            //verify boundaries
            if ((colour == 0) && (led3_dir == -1)){
                colour = 6;
            } else if ((colour == 6) && (led3_dir == 1)){
                colour = 0;
            } else {
                colour = colour + led3_dir; //change colour based on direction
            }
            //swap colour
            P2OUT = colours[colour];
            TA1CCR1 += blink_rate_3;
        }
        //LED3 blink
        if(led3_blink == 4){
            if(led3_blink_on){
                P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
                led3_blink_on = 0;
                TA1CCR1 += blink_rate_3;
            } else {
                if ((colour == 0) && (led3_dir == -1)){
                    colour = 6;
                } else if ((colour == 6) && (led3_dir == 1)){
                    colour = 0;
                } else {
                    colour = colour + led3_dir; //change colour based on direction
                }
                led3_blink_on = 1;
                //swap colour
                P2OUT = colours[colour];
                TA1CCR1 += blink_rate_3;
            }
        }

        //fading in/out and breathing, part 1, can be 24
        if((led3_fade_in == 22) || (led3_fade_out == 24) || (led3_breath == 24)){
            if(counter_val_3 < brightness_3){
                P2OUT |= colours[colour];                              //Turn on light
            } else {
                P2OUT &= ~(BIT1 + BIT3 + BIT5);
            }
            counter_val_3 += 1;                             //Increment the value to read from the array

            if(counter_val_3 >= max_brightness){                       //reached max value, reset
                counter_val_3 = 0;
            }
            TA1CCR1 += change_period;
        }

        //fade in part 2
        if((led3_fade_in == 13) || (led3_fade_in == 17) || (led3_fade_in == 20) || (led3_fade_in == 22)) {
            if(light_flag_3 == 0){
                brightness_3 += 1;                //increase brightness
            }

            if(brightness_3 == max_brightness){               //if max brightness
                P2OUT |= colours[colour];             //leave it on
                led3_fade_in = -1;          //completed task
            }

            TA1CCR1 += period_3;
        }

        //fade out part 2
        if((led3_fade_out == 13) || (led3_fade_out == 17) || (led3_fade_out == 20) || (led3_fade_out == 22)) {
            if(light_flag_3 == 1) {
                brightness_3 -= 1;                //decrease brightness
            }

             if (brightness_3 == 0) {       //reached lowest value
                P2OUT &= ~(BIT1 + BIT3 + BIT5);   //keep light off
                led3_fade_out = -2;          //completed task, deactivate it
            }

            TA1CCR1 += period_3;
        }

        //breathing part 2
        if((led3_breath == 13) || (led3_breath == 17) || (led3_breath == 20) || (led3_breath == 22)){
            if(light_flag_3 == 0){
                brightness_3 += 1;                //increase brightness
            } else {
                brightness_3 -= 1;                //decrease brightness
            }

            if(brightness_3 == max_brightness){               //if max brightness
                light_flag_3 = 1;                //set to decrease
            } else if (brightness_3 == 0) {       //reached lowest value
                light_flag_3 = 0;                //increase light
                //change colour
                //verify boundaries
                if ((colour == 0) && (led3_dir == -1)){
                    colour = 6;
                } else if ((colour == 6) && (led3_dir == 1)){
                    colour = 0;
                } else {
                    colour = colour + led3_dir; //change colour based on direction
                }
            }

            TA1CCR1 += period_3;
        }

        //buzzer
        if(buzzer_tone == 4){
            buzzer_count += 1;  //increment count
            //alternate the pins
            P2OUT ^= BIT2;
            P2OUT ^= BIT4;

            //check if less or greater than the wanted duration
            if(buzzer_count >= buzzer_duration){
                buzzer_tone = -2; //turn it off
            }

            TA1CCR1 += buzzer_period;
        }

        //buzzer beeping
        if(buzzer_beep == 4){
            buzzer_count += 1;  //increment count

            if(buzzer_on) { //if it is on, alternate
                //alternate the pins
                P2OUT ^= BIT2;
                P2OUT ^= BIT4;
                //check if less or greater than the wanted duration
                if(buzzer_count >= buzzer_duration){
                    buzzer_on = 0; //turn off
                    buzzer_count = 0; //reset count
                }

            } else { //if off, turn both off
                P2OUT &= ~BIT2;
                P2OUT &= ~BIT4;

